src/app/Controllers/AdminListUsers.php

    public function listUsers()
    {
        $userModel = new \App\Models\UserModel();
        $data['users'] = $userModel->where('role', 'user')->orderBy('nom', 'ASC')->findAll();
---
SELECT *
FROM `users`
WHERE `role` = 'user'
ORDER BY `nom` ASC