src/app/Controllers/AdminRegimes.php

SELECT *
FROM `regimes`
---
    public function index()
    {
        $data['regimes'] = $this->regimeModel->findAll();