src/app/Controllers/StudentController.php

SELECT `etudiant`.*, GROUP_CONCAT(parcours.nom ORDER BY parcours.nom SEPARATOR ", ") as parcours_nom
FROM `etudiant`
LEFT JOIN `etudiant_parcours` ON `etudiant_parcours`.`etudiant_id` = `etudiant`.`id`
LEFT JOIN `parcours` ON `parcours`.`id` = `etudiant_parcours`.`parcours_id`
GROUP BY `etudiant`.`id`
ORDER BY `etudiant`.`nom` ASC
---
    public function index()
    {
        $db = Database::connect();

        $students = $db->table('etudiant')
            ->select('etudiant.*, GROUP_CONCAT(parcours.nom ORDER BY parcours.nom SEPARATOR ", ") as parcours_nom')
            ->join('etudiant_parcours', 'etudiant_parcours.etudiant_id = etudiant.id', 'left')
            ->join('parcours', 'parcours.id = etudiant_parcours.parcours_id', 'left')
            ->groupBy('etudiant.id')
            ->orderBy('etudiant.nom', 'ASC')
            ->get()
            ->getResultArray();

SELECT `etudiant`.*, GROUP_CONCAT(parcours.nom ORDER BY parcours.nom SEPARATOR ", ") as parcours_nom
FROM `etudiant`
LEFT JOIN `etudiant_parcours` ON `etudiant_parcours`.`etudiant_id` = `etudiant`.`id`
LEFT JOIN `parcours` ON `parcours`.`id` = `etudiant_parcours`.`parcours_id`
WHERE `etudiant`.`id` = 1
GROUP BY `etudiant`.`id`
---
    public function show(int $id)
    {
        $db = Database::connect();

        $student = $db->table('etudiant')
            ->select('etudiant.*, GROUP_CONCAT(parcours.nom ORDER BY parcours.nom SEPARATOR ", ") as parcours_nom')
            ->join('etudiant_parcours', 'etudiant_parcours.etudiant_id = etudiant.id', 'left')
            ->join('parcours', 'parcours.id = etudiant_parcours.parcours_id', 'left')
            ->groupBy('etudiant.id')
            ->where('etudiant.id', $id)
            ->get()
            ->getRowArray();

SELECT `ue`.`id` as `ue_id`, `ue`.`nom` as `ue_nom`, `ue`.`code`, `ue`.`credits`, `programme`.`type`, `programme`.`groupe_choix`, `semestre`.`numero`
FROM `programme`
JOIN `ue` ON `ue`.`id` = `programme`.`ue_id`
JOIN `semestre` ON `semestre`.`id` = `programme`.`semestre_id`
WHERE `programme`.`parcours_id` = 1
AND `semestre`.`numero` = 3
ORDER BY `programme`.`type` ASC, `programme`.`groupe_choix` ASC, `ue`.`nom` ASC
---
    private function getProgrammeBySemester(int $parcoursId, int $semesterNum): array
    {
        $db = Database::connect();

        return $db->table('programme')
            ->select('ue.id as ue_id, ue.nom as ue_nom, ue.code, ue.credits, programme.type, programme.groupe_choix, semestre.numero')
            ->join('ue', 'ue.id = programme.ue_id')
            ->join('semestre', 'semestre.id = programme.semestre_id')
            ->where('programme.parcours_id', $parcoursId)
            ->where('semestre.numero', $semesterNum)
            ->orderBy('programme.type', 'ASC')
            ->orderBy('programme.groupe_choix', 'ASC')
            ->orderBy('ue.nom', 'ASC')
            ->get()
            ->getResultArray();

SELECT `parcours_id`
FROM `etudiant_parcours`
WHERE `etudiant_id` = 1
ORDER BY `parcours_id` ASC
---
    private function resolveParcoursId(int $studentId, string $optionOverride, array $optionMap): ?int
    {
        $db = Database::connect();

        if ($optionOverride !== '' && array_key_exists($optionOverride, $optionMap)) {
            return $optionMap[$optionOverride];
        }

        $row = $db->table('etudiant_parcours')
            ->select('parcours_id')
            ->where('etudiant_id', $studentId)
            ->orderBy('parcours_id', 'ASC')
            ->get()
            ->getRowArray();

SELECT `note`.`id`, `note`.`note`, `note`.`created_at`, `ue`.`nom` as `ue_nom`, `semestre`.`numero`, `programme`.`type`, `programme`.`groupe_choix`
FROM `note`
JOIN `ue` ON `ue`.`id` = `note`.`ue_id`
JOIN `programme` ON `programme`.`ue_id` = `ue`.`id`
JOIN `semestre` ON `semestre`.`id` = `programme`.`semestre_id`
WHERE `note`.`etudiant_id` = 1
AND `programme`.`parcours_id` = 1
ORDER BY `note`.`created_at` DESC
---
    private function getGradeHistory(int $studentId, int $parcoursId): array
    {
        $db = Database::connect();

        return $db->table('note')
            ->select('note.id, note.note, note.created_at, ue.nom as ue_nom, semestre.numero, programme.type, programme.groupe_choix')
            ->join('ue', 'ue.id = note.ue_id')
            ->join('programme', 'programme.ue_id = ue.id')
            ->join('semestre', 'semestre.id = programme.semestre_id')
            ->where('note.etudiant_id', $studentId)
            ->where('programme.parcours_id', $parcoursId)
            ->orderBy('note.created_at', 'DESC')
            ->get()
            ->getResultArray();