src/app/Controllers/UsersAuth.php

SELECT *
FROM `users`
WHERE `email` = 'jean@test.mg'
AND `role` = 'user'
 LIMIT 1
---
    public function loginCheck()
    {
        $session  = session();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $userModel = new \App\Models\UserModel();
        $user = $userModel->where('email', $username)
                          ->where('role', 'user')
                          ->first();

INSERT INTO `users` (`nom`, `prenom`, `email`, `password`, `genre`, `date_naissance`, `role`) VALUES ('Raharimiranty', 'gaelle', 'raharimirantyannelle@gmail.com', '$2y$10$rHHFxEytVcAhRq9xH1ZePeELP/xN6gdfHsnrVGE.ZeA1ZvdeMa99S', 'F', '2007-03-15', 'user')
INSERT INTO `user_health` (`user_id`, `taille`, `poids`, `imc`, `date_mesure`) VALUES (7, 168, 55, 19.49, '2026-05-09 08:41:15')
---

        // Création de l'utilisateur
        $userModel = new \App\Models\UserModel();
        $userId = $userModel->insert([
            'nom'            => $step1['nom'],
            'prenom'         => $step1['prenom'],
            'email'          => $step1['email'],
            'password'       => $step1['password_hash'],
            'genre'          => $step1['genre'],
            'date_naissance' => $step1['date_naissance'],
            'role'           => 'user',
        ]);

        // Enregistrement de la mesure de santé initiale dans user_health
        $db = \Config\Database::connect();
        $db->table('user_health')->insert([
            'user_id'     => $userId,
            'taille'      => $taille,
            'poids'       => $poids,
            'imc'         => $imc,
            'date_mesure' => date('Y-m-d H:i:s'),
        ]);